DataProcessors/УдалениеРеестров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<DataProcessor>
		<Properties>
			<Name>УдалениеРеестров</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Реестр</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗагрузкаРеестров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Объекты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Объект</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
								<v8:Type>cfg:CatalogRef.УслугиПоДоговору</v8:Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
								<v8:Type>cfg:CatalogRef.Залоги</v8:Type>
								<v8:Type>cfg:CatalogRef.ИсполнительныеДокументы</v8:Type>
								<v8:Type>cfg:CatalogRef.ДолговыеОбязательства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/ЗагруженныеОбъекты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>ЗагруженныеОбъекты</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
						<v8:Type>cfg:CatalogRef.УслугиПоДоговору</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Залоги</v8:Type>
						<v8:Type>cfg:CatalogRef.ИсполнительныеДокументы</v8:Type>
						<v8:Type>cfg:CatalogRef.ДолговыеОбязательства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

DataProcessors/УдалениеРеестров/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура РеестрПриИзменении(Элемент)
	ПоказатьОбъекты();
КонецПроцедуры

&НаСервере
Процедура ПоказатьОбъекты()
	Объект.Объекты.Очистить();
	Объект.Объекты.Загрузить(Объект.Реестр.СозданныеОбъекты.Выгрузить());
КонецПроцедуры

&НаКлиенте
Процедура УдалитьРеестр(Команда)
	УдалитьРеестрСервер();
КонецПроцедуры

&НаСервере
Процедура УдалитьРеестрСервер()
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ЗагруженныеОбъекты.Объект
	                      |ПОМЕСТИТЬ Объекты
	                      |ИЗ
	                      |	РегистрСведений.ЗагруженныеОбъекты КАК ЗагруженныеОбъекты
	                      |ГДЕ
	                      |	ЗагруженныеОбъекты.Регистратор = &Регистратор
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	Мероприятие.Объект
	                      |ИЗ
	                      |	Задача.Мероприятие КАК Мероприятие
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Объекты КАК Объекты
	                      |		ПО Мероприятие.Объект = Объекты.Объект
	                      |ГДЕ
	                      |	Мероприятие.ПометкаУдаления = ЛОЖЬ
	                      |	И Мероприятие.Выполнена = ЛОЖЬ");
	//Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Регистратор", Объект.Реестр);
	Результат = Запрос.Выполнить().Выбрать();
	Если Результат.Следующий() Тогда
		Сообщить("По данному реестру имеются невыполненные мероприятия!");
	Иначе
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ЗагруженныеОбъекты.Объект
	                      |ИЗ
	                      |	РегистрСведений.ЗагруженныеОбъекты КАК ЗагруженныеОбъекты
	                      |ГДЕ
	                      |	ЗагруженныеОбъекты.Регистратор = &Регистратор");
	//Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Регистратор", Объект.Реестр);
	Результат = Запрос.Выполнить().Выбрать();
		Для Каждого Элемент из Объект.Объекты Цикл
			//ЭлементОбъект = Справочники.ДолговыеОбязательства.СоздатьЭлемент();
			ЭлементОбъект = Элемент.Объект.ПолучитьОбъект();
			ЭлементОбъект.ПометкаУдаления = Истина;
			ЭлементОбъект.Записать();
		КонецЦикла;
		ДокументОбъект = Объект.Реестр.ПолучитьОбъект();
		ДокументОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения, РежимПроведенияДокумента.Неоперативный);
		ДокументОбъект.ПометкаУдаления = Истина;
		ДокументОбъект.Записать(РежимЗаписиДокумента.Запись, РежимПроведенияДокумента.Неоперативный);
		Сообщить("Реестр удален!");
	КонецЕсли;
КонецПроцедуры
